src/main/resources/testCon.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://www.webservicex.net">
   <soapenv:Header/>
   <soapenv:Body>
      <web:GetWeatherByPlaceName>
         <!--Optional:-->
         <web:PlaceName>IST</web:PlaceName>
      </web:GetWeatherByPlaceName>
   </soapenv:Body>
</soapenv:Envelope>